app/controllers/boards_controller.rb

SELECT * FROM "boards"
---
  def index
    @boards = Board.all

SELECT * FROM "boards" WHERE ("boards"."id" = 2)
---
  def show
    @board = Board.find(params[:id])

SELECT * FROM "boards" WHERE ("boards"."id" = 2)
---
  def edit
    @board = Board.find(params[:id])

INSERT INTO "boards" ("created_at", "title", "updated_at", "publish") VALUES('2010-10-31 03:13:20', 'warren', '2010-10-31 03:13:20', 'f')
---
  def create
    @board = Board.new(params[:board])

    respond_to do |format|
      if @board.save

SELECT * FROM "boards" WHERE ("boards"."id" = 3)
---
  def update
    @board = Board.find(params[:id])

SELECT * FROM "boards" WHERE ("boards"."id" = 16)
DELETE FROM "boards" WHERE "id" = 16
---
  def destroy
    @board = Board.find(params[:id])
    @board.destroy