app/controllers/layers_controller.rb

SELECT * FROM "layers" WHERE ("layers"."board_id" = 3)
---
  def index
    if @board != nil
      @layers = @board.layers.all

INSERT INTO "layers" ("board_id", "name", "created_at", "token", "updated_at", "order") VALUES(3, 'Rock', '2010-11-02 01:43:05', '99c983e499ebce001459c57cf1aec9ec', '2010-11-02 01:43:05', NULL)
---
  def create
    @layer = @board.layers.new(params[:layer])

    respond_to do |format|
      if @layer.save